{
  "domain": "Economics",
  "scene_name": "homogeneous_grid_mining_no_comm_property_rights",
  "odd_protocol": {
    "overview": {
      "system_goal": "Test whether stable property rights, reduced conflict, higher total output, and norm emergence (first possession and recognition) can arise endogenously among homogeneous agents mining on a homogeneous grid with non-depleting resources and per-round extraction caps under no communication and no authority, while guiding LLM agents with explicit heuristics so that even with model noise the system tends toward equal-share steady states and meets worst-case paper conclusions.",
      "agent_types": "Homogeneous LLM-driven miner agents with identical per-round stamina budget S=10 that does not carry over; two population sizes are tested (N=10 and N=20); comparator non-LLM policies include Random, Greedy-Mine, Defend-then-Mine, and Tit-for-tat-Raid for benchmarking; agents cannot communicate and have no coordinating authority.",
      "environment_description": "A 10x10 homogeneous grid with 100 plots; time proceeds in discrete simultaneous-move rounds (recommended R=200 with robustness at 100 and 500); resources are non-depleting with per-plot per-round mining cap M_CAP=3 and productivity alpha=1 gold per stamina; at most one owner per plot per round; initial condition at round 1 is all plots unowned.",
      "no_communication_no_authority": "Agents cannot communicate and there is no adjudicating authority; outcomes arise purely from the action space and platform resolution logic.",
      "resource_and_payoff_structure": "Per plot per round output equals min(allocated mining stamina, M_CAP=3) times alpha with default alpha=1; newly captured plots cannot be mined in the same round by the captor; mining allocations must be integer and per-plot bounded by 0..3; theoretical per-round system output upper bound is 100*3=300.",
      "initial_property_state": "At round 1 the entire grid is unowned; one plot can have at most one owner per round; claims on unowned plots are resolved before raids within a round; newly claimed plots are immune to raids within the same round by default (immunity window length baseline=1).",
      "baseline_hypotheses_and_expectations": "Under homogeneous land and equal stamina, if defense precommitment plus per-round mining cap makes raiding less profitable than stable mining, conflict should decrease and property rights should stabilize; expect higher efficiency, a trade-off between concentration and stability, and possible first occupancy norm emergence; with added LLM guidance heuristics, even with LLM noise the mechanism should tend toward an equal-share steady state and in worst cases still produce the paper's conclusions.",
      "treatment_scope_summary": "After the homogeneous baseline, vary immunity window length, defense strength model, stamina budget S, mining cap M_CAP, population size N, history visibility extent, and then explore heterogeneous resource productivity, heterogeneous stamina, enabling communication, and adding authority with raid taxes or punishments.",
      "agent_instruction_language_and_prompting": "Per-round inputs to LLM agents can be in Chinese or English and include a concise rules summary and explicit objective to maximize long-run cumulative gold; the prompt includes compressed occupancy summary, the agent's parcel list, last round conflicts and results, mining cap=3, and output rate=1.",
      "scene_specific_goal_statement": "Demonstrate endogenous stabilization of ownership and efficiency on a homogeneous grid through defense, mining caps, and first possession dynamics without exogenous coordination, while using explicit agent-side heuristics to nudge toward fair division and stability."
    },
    "design_concepts": {
      "interaction_patterns": "Each round, every agent allocates integer stamina across actions: Claim unowned plots (1 stamina per target), Raid owned plots (1 stamina per target), Defend own plots via precommitment (1 stamina per defended plot, consumed even if no raid occurs), and Mine own plots (0..3 per plot up to M_CAP=3); actions are submitted as an ordered list reflecting priority; platform cleans invalid items, then prunes from the tail to satisfy the budget; resolution is deterministic in the sequence Claims, then Raids, then Mining with tie-breaking by seeded RNG; newly claimed plots are immune to raids within the same round by default.",
      "communication_protocols": "No inter-agent communication or signaling; public observables at round start include full map ownership, prior round plot-level events (defense, raids, raid success, claim contests), and optional rolling summaries over the last K=5 rounds; private info includes the agent's cumulative gold and own action history; agents may use internal memory.",
      "decision_mechanisms": "LLM agents produce an ordered JSON action list constrained by integer stamina budgets and platform pruning; priority equals submission order; platform enforces feasibility by removing invalid targets and tail-pruning over-budget plans; tie-breaking in contested claims and raids uses a reproducible RNG seeded by a hash of global seed, round number, plot identifier, and event type with participants sorted by agent ID ascending; defense blocks all raids regardless of number under baseline defense model.",
      "defense_and_raiding_logic": "If a plot is defended this round, all raids on that plot fail and raiders lose raid stamina; if not defended, a single raider immediately takes ownership; if multiple raiders target an undefended plot, a seeded RNG selects the winner; prior owner loses the plot; non-winning raiders lose their raid stamina; newly captured plots cannot be mined by the captor in the capture round.",
      "mining_and_productivity": "Mining resolves after property outcomes; owners receive min(allocated, 3) times alpha gold with alpha=1; if the owner lost the plot earlier in the round, the owner's mining on that plot yields zero; per-plot mining allocations are integers in 0..3.",
      "public_observables_and_memory": "At round start, agents see the full ownership map, last round public events per plot or K=5 rolling summaries, and optional aggregate statistics; they also know S, M_CAP, and the reward function; agents may maintain internal memory beyond provided context.",
      "evaluation_metrics_and_goals": "Core metrics include property stability (plot turnover rate, property half-life), conflict intensity (raid rate, defense trigger rate, raid success rate), efficiency (total output vs 300), idle stamina rate, distribution (gold Gini, ownership HHI), behavior evolution (time trends in action shares, respect-for-first-possession); statistical protocol uses 20 seeds per treatment with mean and 95% confidence intervals and tests for significantly lower turnover and raid rates and higher output in the second half.",
      "robustness_and_ablation_design": "Treatments vary immunity window (1 baseline vs 0), defense strength (block-all vs per-point offsets one raid), S in {8,10,12}, M_CAP in {2,3,4}, N in {10,20}, and history visibility (last round only vs last 5 baseline vs full history); heterogeneous extensions include varied alpha across plots, heterogeneous stamina, enabling communication, and adding authority with adjudication or raid taxes or punishments.",
      "norm_emergence_focus": "Investigate whether LLM agents adopt first possession norms as observed through declining raid frequency on long-held plots and declining turnover despite homogeneous resources and capabilities.",
      "agent_guidance_heuristics_and_priorities": "LLM prompt includes explicit thought constraints: when plots owned are insufficient, prioritize claiming unowned plots; if raiding becomes necessary, prioritize targeting the largest landholder's border plots; when already owning enough plots, focus on mining; when challenged, prioritize defending core plots; these heuristics are intended to steer behavior toward fair and stable allocations even under LLM noise.",
      "fault_tolerance_and_random_rationalization_policy": "Parsing and fault tolerance specify that if a submitted plan exceeds stamina, attempts unauthorized actions, or contains illegal coordinates, the system will prune or reject and perform randomized rationalization to make the plan feasible; core platform still applies deterministic cleaning and tail-pruning, with any randomized rationalization using seeded randomness to preserve reproducibility where applicable.",
      "agent_objective_statement": "Agents are explicitly instructed that the objective is to maximize long-term cumulative gold under the given rules and constraints while operating without communication and without knowledge of others' current-round decisions."
    },
    "details": {
      "agent_behaviors": "Per round, each agent submits an ordered plan of actions consuming integer stamina up to S=10: Defend own plots (1 per plot, consumed even if unraided), Mine own plots with k in 0..3 per plot bounded by M_CAP=3, Claim unowned plots (1 per target), and Raid plots owned by others (1 per target); agents cannot mine or defend plots they do not own; newly claimed plots cannot be raided in the same round due to an immunity window (baseline length 1); newly captured plots cannot be mined by the captor until the following round; all agents act simultaneously and the platform resolves in Steps 0..4.",
      "decision_algorithms": "Resolution sequence is deterministic and reproducible: Step 0 (ingest actions and validate) removes illegal items (out-of-bounds cells, attempts to mine/defend non-owned plots, duplicates), then tail-prunes to satisfy S while preserving priority order; if defense precommitment alone exceeds S due to owning many plots, tail-pruning spans the entire plan; in the rare case the pruned plan remains infeasible the agent does nothing and consumes zero stamina; Step 1 (Claims) grants unowned plots to unique claimants or uses seeded RNG to pick among multiple claimants and applies same-round immunity; Step 2 (Raids) resolves attacks on already-owned, non-immune plots with defense blocking all raids, single-raider captures, and contested raids resolved by seeded RNG; Step 3 (Mining) pays min(allocated,3)*alpha to final owners; Step 4 (Round End) logs all events and clears defense flags.",
      "specific_constraints": "S=10 per agent per round with no carryover; M_CAP=3 per plot per round; alpha=1 gold per stamina; action costs are integers: Claim=1 per target, Raid=1 per target, Defend=1 per defended plot, Mine=k with k in 0..3 per plot; each plot can have at most one owner per round; same-round immunity for newly claimed plots defaults to 1 round; newly captured plots cannot be mined in the capture round.",
      "platform_cleaning_and_pruning_policy": "Platform removes invalid references, unauthorized actions, and duplicates, then computes total stamina cost and deletes actions from the end of the submitted sequence until total cost is within S, preserving the agent's stated priorities; if the resulting plan is empty or infeasible, the agent performs no actions and stamina consumption is zero.",
      "rng_and_reproducibility": "Tie-breaking uses a seeded RNG initialized by a deterministic hash of global seed, round number, plot identifier, and event type (Claim or Raid); for each contested plot, participants are sorted by agent ID ascending before random selection; map scanning is row-major (0,0) to (9,9) for any ordered traversal; full logs and snapshots including RNG sequences are saved each round for perfect reproducibility; experiments use global seeds seed_global in a set such as 1..20.",
      "public_information_and_summaries": "At round start, agents observe the complete ownership map, the last round's public events per plot (defense set, raids occurred, raid success, contested claims), optional rolling summaries over the last K=5 rounds, and may optionally receive compressed occupancy summaries to reduce context length; agents also know S, M_CAP, reward function, and their cumulative gold and own action history.",
      "logging_and_metrics_protocol": "Per-plot logs record owner ID, defense status, raids, and ownership changes; per-agent logs include stamina allocations by action, gold earned, and number of plots owned; global logs include counts of claims, raids, defenses, successful raids, and total output; evaluation computes turnover rate, property half-life, raid rate, defense trigger rate, raid success rate, efficiency vs 300, idle stamina rate, gold Gini, plot ownership HHI, and evolution of action shares, with comparisons between first and second halves of the horizon and 95% confidence intervals across 20 seeds.",
      "baseline_and_comparator_policies": "Comparator strategies include Random (uniform random stamina allocation), Greedy-Mine (mine first if owning plots then claim or raid), Defend-then-Mine (defend all owned plots before mining then residual actions), and Tit-for-tat-Raid (raid those who just raided me) to probe retaliatory dynamics and sustained conflict.",
      "treatments_and_ablation_parameters": "Treatments include immunity window 1 baseline vs 0, defense strength block-all baseline vs per-point defense offsets one raid, S in {8,10,12}, M_CAP in {2,3,4}, N in {10,20}, history visibility last round only vs last 5 baseline vs full history (available but not recommended), and heterogeneous extensions with uneven plot productivity (higher alpha 'gold mines'), heterogeneous stamina across agents, enabling communication, and introducing authority with adjudication or sanctions such as taxing or punishing raids.",
      "agent_interface_io_template_bilingual": "Per-round LLM input template (Chinese or English): '你是矿工 #k。本回合你有 S 点体力。网格占有简表（少量压缩编码）、你的地列表、上回合冲突与结果、采矿上限=3、产出率=1。规则简述：占领空地1点，抢占1点，防御（若被抢占）1点阻断所有挑战，采矿每块最多3点。目标：最大化长期累计黄金。不能沟通，不知道他人当回合决策。' Output requirement (JSON): fields claim, raid, defend, mine where mine entries specify s<=3; the system will parse this ordered JSON-like list and apply pruning as needed.",
      "agent_output_contract_json_fields": "Agents output an ordered JSON-like action list with fields: 'claim': list of [x,y] for unowned plots; 'raid': list of [x,y] for plots owned by others; 'defend': list of [x,y] for owned plots the agent commits 1 stamina to defend this round; 'mine': list of objects like {'cell':[x,y],'s':n} where n<=3; order encodes priority and the platform prunes from the tail if over budget; narrative or commentary is optional and ignored by the executor.",
      "parsing_and_fault_tolerance_rules": "If stamina exceeds budget, actions are unauthorized, or coordinates are illegal, the system will prune or reject and perform randomized rationalization to produce a reasonable feasible plan; this complements the deterministic validation and tail-pruning pipeline and may use seeded randomness to maintain reproducibility.",
      "thought_constraints_and_policy_guidance": "To reduce LLM drift and noise, prompts include guidance: prioritize claiming unowned land when owned plots are insufficient; if raiding is necessary, focus on the largest landlord's border plots; once owning enough plots, prioritize mining up to the per-plot cap; when being challenged, prioritize defending core plots first; these constraints aim to bias the system toward equal division and a stable steady state while still allowing endogenous norm emergence.",
      "border_targeting_and_core_defense_definitions": "Border plots for raiding are plots at the perimeter of the largest landholder's contiguous or total holdings (implementation may use adjacency on the grid to identify borders); core plots for defense are a subset of currently owned plots deemed most valuable or central by the agent (e.g., high-connectivity or long-held plots) and are defended first under budget limits.",
      "agent_objective_and_uncertainty": "Agents are reminded each round that the objective is to maximize long-term cumulative gold; they cannot communicate and do not know other agents' current-round decisions, making the environment simultaneous and strategically uncertain.",
      "map_and_identifier_conventions": "Plots are addressed by coordinates (row,column) in a 10x10 grid or by a plot identifier consistent with a 100x1 ownership vector; any ordered traversal uses row-major order from (0,0) to (9,9) to ensure deterministic processing.",
      "efficiency_bound_and_targets": "Theoretical per-round production upper bound equals 100 plots times cap 3 equals 300 gold; efficiency is realized output divided by 300; key tests examine whether in the latter half of rounds turnover and raid rates are significantly below the first half and total output increases as property stabilizes.",
      "immunity_and_defense_reset": "Defense flags last only for the current round and are cleared at round end; newly claimed plots are immune from raids during the same round by default (baseline immunity window length=1).",
      "expected_outcomes_under_guided_heuristics": "Even with LLM response noise, the specified input-output protocol and thought constraints are designed to bias the dynamics toward an equal-share steady state and deliver results that at worst still align with the paper's main conclusions about stabilization and efficiency."
    }
  }
}